app/controllers/albums_controller.rb

SELECT * FROM `albums` WHERE (`albums`.`id` = 3)
---
  def show
    @album = Album.find(params[:id])

INSERT INTO `albums` (`name`, `image_url`, `movie_id`, `genre_id`, `lyricist_id`, `year`, `description`, `music_director_id`) VALUES('Maine Pyaar Kiya', '', 1, 2, NULL, NULL, 'Test', NULL)
---
  def create

    @album = Album.new(params[:album])

    respond_to do |format|
      if @album.save