app/controllers/artists_controller.rb

  def index
   @artists = Artist.active.rated.limit(4).order
---
SELECT * FROM `artists`