app/controllers/awards_controller.rb

SELECT * FROM `awards` WHERE (`awards`.`id` = 1)
---
  def show
    @category = AwardCategories.find(params[:id])
    @awards = MovieAward.find(:all, :conditions => [ "award_id = ?", params[:id]])