app/controllers/genres_controller.rb

SELECT * FROM `genres` WHERE (`genres`.`id` = 1)
---
  def show
    @genres = Genre.find(:all)