app/controllers/movies_controller.rb

  def index
   @movies = Movie.find(:all, :limit => 4, :conditions => 'rating > 4', :order => 'rating DESC')
---
SELECT * FROM `movies` WHERE (rating >= 3)

  def show
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)

  def showcast
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)

  def reviews
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)

  def awards
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)

  def videos
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)

  def edit
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)

  def update
    @movie = Movie.find(params[:id])
    respond_to do |format|
      if @movie.update_attributes(params[:movie])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)
UPDATE `movies` SET `description` = 'Don - EDIT The Chase Begins Again, directed by Farhan Akhtar, is a remake of the blockbuster 1978 film, Don. The film was released in India on October 20, 2006 and it was also simultaneously released internationally. It received a very good response worldwide, and collected over Rs. 30 crores in India in its first week itself. The script of the previous film was written by Akhtar\'s father, Javed Akhtar and Salim Khan (father of Salman Khan).\r\n\r\nThe film stars Shahrukh Khan, Priyanka Chopra, Arjun Rampal, Ishaa Koppikar and Kareena Kapoor in a guest appearance. Eighty percent of the movie was shot in Malaysia, and was filmed around the tropical Langkawi island as well as the Petronas Twin Towers and the Jalan Masjid India area, which is the \'little India\' of Kuala Lumpur. Akshay Kumar was offered for the role of Jasjit but he rejected saying he might have accepted if he was offered the part of Don.[1] Shahrukh Khan and Priyanka Chopra underwent special martial arts training for their roles in the movie.\r\n\r\nThe film was selected to be screened at the Berlin Film Festival.[2] Critical reaction was mixed, with Variety stating that the film \"could have been much better.\"[3]' WHERE `id` = 1

  def editartists
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)

  def editgenres
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 2)

  def updategenres
    @movie = Movie.find(params[:id])
    @selected_genres = Array.new
    movie_param = params[:movies]
    # logger.debug ("FindMe I'm in genre update #{movie_param[:genre_ids].length}")
    movie_param[:genre_ids].each do |genre_id|
        @selected_genres << Genre.find(genre_id)
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 2)
SELECT * FROM `genres` WHERE (`genres`.`id` = 5)

  def editawards
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 2)

  def updateawards
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 2)