app/controllers/movies_controller.rb

  def index

   @movies = Movie.active.rated.limit(10).order
---
SELECT * FROM `movies`