app/controllers/ragas_controller.rb

SELECT * FROM `ragas` WHERE (`ragas`.`id` = 1)
---
   def show
     @raga = Raga.find(params[:id])